       >>SOURCE FORMAT FREE

IDENTIFICATION DIVISION.
PROGRAM-ID. MAIN-DATABASE-CLASSIFICATION.
AUTHOR. Connor Brady.
DATE-WRITTEN. November 14th 2020

ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SPECIAL-NAMES.
       CLASS GradeToPass IS "A" THRU "C, "D".

DATA DIVISION.
FILE SECTION.

WORKING-STORAGE SECTION.
01 Age PIC 99 VALUE 0.
01 Grade PIC 99 VALUE 0.
01 Score PIC X(1) VALUE "B"
01 CanVoteFlag PIC 9 VALUE 0.
       88 CanVote VALUE 1.
       88 CantVote VALUE 0.

01 TestNumber PIC X.
       88 IsPrime VALUE "1", "3", "5", "7"
       88 IsOdd VALUE "1", "3", "5", "7", "9"
       88 IsEvent VALUE "2", "4", "6", "8"
       88 LessThan5 VALUE "1" THRU "4"

PROCEDURE DIVISION.

STOP RUN.