       >>SOURCE FORMAT FREE

*> PROGRAM DETAILS
IDENTIFICATION DIVISION.
PROGRAM-ID. MAIN.
AUTHOR. Connor Brady.
DATE-WRITTEN. November 14th 2020.

ENVIRONMENT DIVISION.

DATA DIVISION.
FILE SECTION.

*> PROGRAMING VARIABLES
WORKING-STORAGE SECTION.
01 UserName PIC X(30) VALUE "CodoxConnor".
01 UserPreBalance PIC 9 VALUE ZEROS.
01 UserTransactionValue PIC 9 VALUE ZEROS.
01 UserNewBalance PIC 99 VALUES 0.
01 NINumber PIC X(10).

01 TaxRate CONSTANT AS 20.

*> OTHER TYPES
*> ZERO, ZEROS
*> SPACE SPACES
*> HIGH-VALUE HIGH-VALUES
*> LOW-VALUE LOW-VALUES

*> PROGRAM TO RUN
PROCEDURE DIVISION.

DISPLAY "Name " WITH NO ADVANCING
ACCEPT UserName
DISPLAY "Editing " UserName

STOP RUN.
